org/lects/15.org
# 2018.07.23 15回目

* 今日の講義 7/23

** おしらせ
*** 講義後，質問時間を設けます

    A,B 両クラスとも，やり残しや質問等あれば，昼休み(12:30頃から)か講義
    終了後(16:00~) から対応します。希望はありますか？

** 今日の課題

*** レポートの提出

    成績評価するために，レポートを提出してもらいます。
    [[https://drive.google.com/open?id=15_E9TfxKCQQkiCtjY2hxcPV6FkJWMIXU][レポート提出の見本]] を参考にしてください。

    - タイピング練習に関するレポート

      - タイピング記録.xlsx
      - タイピングレポート.docx

    - レポート作成に関する課題
      - 教科書「著作権とファイル交換ソフト」を提出済み
	- さらに，理解を深めるために，見出し2を用いた課題を自習してくだ
          さい。

      - 「大学生らしいレポートの書き方」を提出してください．

    - 教科書を読んで，「Webとインターネット」に関するまとめを作成し，
      レポートとして提出してください

    - Googleサイトで自分の情報処理演習のページを作成

      Web上のハイパーテキストによる情報発信と共有を実践します。

    - 教科書の6章の「大学の概要」と「得点と偏差値の表」

      - 教科書6章を読んで自分で作成してください。

    - 講義のまとめ
     
      講義のまとめを書いて，レポート提出フォルダに提出してください。
     
      学んだ事柄について考え，自分の知識にするためにおこないます。
      関連づけて考え，記憶することが大切です。


*** 自分の文書とUSBメモリ

    今日作業した文書は，わかりやすい場所に保存してありますか？

    この講義で作成した文書は，自分の情報処理フォルダに，整理して，保存
    しましょう。

    情報処理フォルダの中に文書が増えてきたので，整理のために，フォルダ
    を作成し，適切な場所に移動しましょう。たとえば

    - 「タイピング」
      - タイピング記録に関連するもの
    - 「レポート文書作成」
      - 著作権とファイル交換ソフト関連
      - 大学生らしいレポートの書き方関連
    - 「表計算」
      - 教科書6章関連
    - 「Web」
      - Web関連

**** フォルダのバックアップ

     USBメモリとGoogleドライブにバックアップを作りましょう

     - 以前作成した情報処理フォルダがあれば削除し，

     - 最新の情報処理フォルダを，USBメモリ/GoogleDriveに，コピーしましょう。

     - それらを使って，自宅で，作業を続けられます。

     - 自宅で作業して文書を変更した場合は，大学の自分の情報処理フォル
       ダの文書を置き換えましょう。

**** USBメモリの使い方

     - [X] 記名してください

     - [X] 挿して表示する
       - 「フォルダを開いてファイルを表示」
       - エクスプローラー -- 「PC」-- ドライブをクリックして開く

       - 前回抜き方が悪いと，修復が必要なことがある。修復をクリックして，
	 修復する。
	
     - [X] 「取り出す」を選択して，抜く

       - エクスプローラー -- ドライブで右クリック -- 「取り出す」を選択
	 -- 取り出す

       - 抜き方が悪いと，壊れることがある。

     - [X] フォルダを作成する

     - [X] フォルダをコピーする

     - [X] USBメモリ内をエクスプローラーで検索
       - [X] ファイル名の検索
       - [X] 中身の検索


*** 出席票の提出


** これまでやってきた事

*** タイピング 

   [[./typing.org][タイピング]] を読んで，レポートを作成し始めましょう:

   - [X] ウィンドウ枠の固定をしましょう。
   - [X] 平均，最高，最低値を求めましょう。
   - [X] 正しいタイプ数のグラフとミスタイプ数のグラフを同時に描き，直線と見たときの傾きを求めましょう。
   - [X] 最後の行を使い，式の変更から自由になりましょう。
   - [X] 今日の記録は，最後の行の前に挿入しましょう。
   - [X] 平均，最高，最低値，グラフが自動的に更新されますか
   - [X] 二つのグラフを同時に描く
   - [X] 正しいキー数とミスタイプ数の間の相関係数を求めましょう
   - [X] Wordに表とグラフを貼る

[[https://drive.google.com/open?id=15_E9TfxKCQQkiCtjY2hxcPV6FkJWMIXU][先生のレポート提出の見本フォルダ]] の [[https://drive.google.com/open?id=1yH9FfoRHjtaYCbEH_Qb6Fl_-_lljE-n6][タイピング・フォルダ]] の レポートを
参考にしてください。
     
*** Firefox ポータブルを使いましょう

    [[./firefox.org]]

    - [X] Firefox portable を起動する
    - [X] 「masayuki054 hatena 情報処理演習」で検索，講義の入口ページ
      を探す
    - [X] リンクを右クリックし，新しいタブで開く
    - [X] サイドバーを開く
    - [X] 履歴を表示する
    - [X] ブックマークを表示する
    - [X] テーマを変更する
    - [X] ブックマークツールバーを表示する
    - [X] 検索と検索結果の保存
    - [X]  設定 ー カスタマイズ ー ツールバー ー ブックマークツールバー
      をチェック
    - [ ] 履歴の検索

*** Googleドライブの利用 [4/6]

    [[./google.org]]

**** レポート提出の確認

     皆さんの提出フォルダをコピーしました。

     [[https://drive.google.com/open?id=1HVFAjgdjsykN1zx7GOwzjutdeMFBva5C][先生の講義用Googleドライブ]] の A組のレポート提出フォルダのコピー，
     B組のレポート提出フォルダのコピーは共有されていますので，確認して
     ください。

**** スマホの Googleドライブ アプリ

     次週までにやってみてください
     - [ ] 自分のスマホに，Googleドライブアプリをインストールしてください
     - [ ] スマホで，自分の Googleドライブを開いてみてください

*** [[./web.org][Webアプリを利用しよう]] 

    便利なメモアプリを紹介します。 

    講義資料の [[./web.org][Webアプリを利用しよう]] を読んで，Mindmup を使えるように
    しましょう。

    - Mindmup は思考の記録に使えます。

    - 講義内容の自分の理解を記録してみましょう。

    - 先生の講義のメモは，[[https://drive.google.com/open?id=1JejNpqfR0bNi6jFBghix8AGCUGeZmW2-][先生の講義メモ]] にあります。参考にしてください。

*** Webとインターネットとは

    [[https://drive.mindmup.com/map/16pI02rBt_8vr-Vgt2quLYuYYvskV27vf][先生のMindmup図2]] を使って説明します。

    - 先生の [[https://drive.google.com/open?id=0BwUWvGKIXA9PUWpOQ0JseTBRRmc][Webとインターネットの概念図]] も参考にしてください。
    - レポートの例は，[[https://drive.google.com/open?id=1vfkdQ-_vIFm8pZTnKJj9pFFJA1kbJLFz][Webとは]] を参考にしてください。

**** Webとインターネットについて理解し，まとめを作ってください。

     全体の流れは，[[https://github.com/masayuki054/morioka_u_ict/blob/master/org/articles/Webについて.org][Webとインターネットについてのまとめを作成する]] を読
     んでください。

     教科書3.1節「Web」と 8.1節「Webの歴史」, 9.1, 9.2 情報の調べ方につ
     いて説明します。下記の事をメモ帳 (またはmindmup) でまとめてくださ
     い。

     - 重要な言葉を洗い出し，意味をまとめましょう。
  
       - 教科書を読んでも説明がない言葉は，検索して，調べ，自分のまとめをつ
	 くりましょう。

	 検索した言葉とサイトのURLを，ペアで，メモしましょう

     - 重要な言葉を使って，粗筋をまとめましょう。

     - 次回以降もまとめが継続できるように，まとめた内容と調べたサイトなどを
       保存しましょう:

       - メモ帳の人は，自分の情報処理フォルダに「ウェブとは.txt」で保存しま
	 しょう。

       - mindmup の人は，GoogleDrive のレポート提出フォルダに保存しましょう。

*** Word でレポートを書く (著作権法とファイル交換ソフト)

教科書5章を読み，Word を使い始めましょう。

何回かかけて，Word でレポートを書くための機能を学び，
教科書5章中にある「著作権法とファイル交換ソフト」文書を作成しましょう。

[[http://masayuki054.github.io/morioka_u_ict/text.html#sec-17][講義資料/教科書のまとめ-17章]] にやり方の説明があります。

- [X] [[https://drive.google.com/open?id=1MZPZnazCkYqz_sFEiYkezJel3FdPwOig][著作権法とファイル交換ソフト.txt]] をダウンロードし，

- [X] 文章(レポート)の構成要素と構造について考える

  - [X] 文章を読み，意図をつかむ
  - [X] 各文の役割を考え，どんな文の要素で表わすかを決める
  - [X] マークダウン形式で表す

    - [[http://www.markdown.jp/what-is-markdown/][markdownとは--日本語Markdownユーザー会]]  [[http://www.markdown.jp/syntax/][markdown記法]]

  - [X] マークダウン形式をプレビューして確かめる

   - [[https://daringfireball.net/projects/markdown/dingus][Markdown プレビュー サイト]]

- [X] 構成要素と構造が決った後，Word にコピペ

  - プレビュー画面をコピペするか，
    マークダウン形式をコピペするか，
    どちらかやりやすい方で

- [-] Word で整形 

  マークダウン形式の文書をWordに貼り付け，下記のように，レポートの体裁を
  整えてください: 

  - [X] 気に入ったテーマを選ぶ
    - 「スタイル」，「フォント」，「色使い」が決る
    - フォントや色は，自分なりに調整してもいいです。

  - [X] 教科書に従って整形
    - [X] タイトルの体裁
      - 「題」スタイルの適用
    - [X] 日付・著者名の体裁
      - 適当なスタイルが見つからない
      - 右そろえ
    - [X] 見出しの体裁
      - 「見出し1」スタイルの適用
      - 番号を振るために，見出し1スタイルの変更
      - フォントも小さければ，見出し1スタイルの変更で
    - [X] 箇条書きの体裁
    - [X] 引用の体裁
    - [X] 参考文献の体裁

  - [ ] 見出し2の利用 

    前回と同様に，[[https://drive.google.com/open?id=1X5mf2ZkAZWNXhbtwFuOR9R-LFrYBPPE9][新らしい文書]] (markdown化済み) をWordで整形してください。

    - ## の部分は見出し2スタイルを適用してください。
      - スタイルを変更して，番号付をしてください
      - ナビゲーションウィンドウでアウトライン構造を確認してください
    - レポート提出フォルダに「著作権とファイル交換ソフト.docx」で保
      存してください。

*** 「レポートの書き方」のレポートの作成

   大学生らしいレポートの書き方について調べ，レポートを作成します。

   [[http://www.report.gusoku.net/kihon/][大学レポートの書き方：基本編]] で 大学生らしいレポートの書き方につい
   て調べ，レポートを作成します。各ページをmarkdown化したものを
   [[https://drive.google.com/open?id=1tNddm1WUsTPGbISzkwbfvKCAsDtImgV3][各ページをmarkdown化したものを]] に置きました。編集して使ってください。

   レポート提出までの流れは，[[https://github.com/masayuki054/morioka_u_ict/blob/master/org/articles/%E3%83%AC%E3%83%9D%E3%83%BC%E3%83%88%E3%81%AE%E6%9B%B8%E3%81%8D%E6%96%B9.org][レポートの書き方.org]] を読んでください。

   今日は，

   - [X] 1. なぜ「レポートの書き方」を学ぶのか
   - [X] 2. 論文・レポートと感想文の違い
   - [X] 3. 大学レポートの種類
   - [X] 4. 文体についての注意点
   - [X] 5. レポートの構成 

   について自分で理解し，そのまとめを作ってください。

   まずは，メモ帳で，markdown 形式にするのがいいと思います。
   - [[http://www.markdown.jp/what-is-markdown/][markdownとは--日本語Markdownユーザー会]]  [[http://www.markdown.jp/syntax/][markdown記法]]
   - [[https://daringfireball.net/projects/markdown/dingus][Markdown プレビュー サイト]]

   適宜，Word化してもいいです。

   次週，スムーズに続けられるように，文書やメモやブックマークを保存し
   てください。

*** Google サイト 

    [[./google.org]] の 「Googleサイト」を読んで，自分のページを作成してみましょう。

    - https://sites.google.com/new でサイトを作成し，

    - タイトルの作成

    - レポート提出フォルダをリンク

    - 講義の概要と感想をGoogleDocで作成し，ページからリンクしてくださ
      い。

    - 自分の講義メモがあれば，リンクしてください。
     
*** 講義メモの作成 (自習)

    今日の講義の内容を思いだし，メモしてみましょう。

    学んだ事柄について考え，自分の知識にするためにおこないます。
    関連づけて考え，記憶することが大切です。

    [[https://drive.mindmup.com/map/1JejNpqfR0bNi6jFBghix8AGCUGeZmW2-][先生の講義メモ]] も参考にしてください。
    コピーして，自由に変更して使ってください。

*** 表計算レポートの作成

   何回かかけて，教科書6章を読み，Excelによる表計算について学びましょ
   う。

**** 表とグラフ，Wordへの貼り付け

     教科書6.1~6.6を読み，

     - 自分の情報処理フォルダに，「表計算フォルダ」を作成し，

     - 学部学科別学生数の表とグラフを作成し，
       自分の表計算フォルダに，「学部学科別学生数」で保存してください。

     - 学部学科別学生数の表とグラフを貼ったWord文書を作成し，
       自分の表計算フォルダフォルダに，「大学の概要」で保存してください。

     - GoogleDrive のレポート提出フォルダに「表計算フォルダ」を作成し，
       GoogleDrive の表計算フォルダに，「学部学科別学生数」，「大学の概要」
       を保存してください。

     メモアプリで，Excel で表計算するときに必要なことについてまとめて
     おきましょう。

**** 計算

     教科書6.7~6.9を読み，Excel について学び，
     得点と偏差値.xlsx (Excelブック) を作成してください

**** 提出

     下記の文書を *レポート提出フォルダ* の *表計算* フォルダに提出しましょう。

     - 大学の概要.docx (Word文書)
     - 学部学年別学生数.xlsx (Excelブック)
     - 得点と偏差値.xlsx (Excelブック)

